Тестовая_база_ERP_14/src/DataProcessors/CRM_МенеджерПочты/CRM_МенеджерПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МенеджерПочты</name>
</mdclass:DataProcessor>

Тестовая_база_ERP_14/src/InformationRegisters/ПредметыПапкиВзаимодействий/ПредметыПапкиВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредметыПапкиВзаимодействий</name>
  <resources>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>ПапкаЭлектронногоПисьма</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </resources>
  <resources>
    <name>Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Взаимодействие</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/CRM_НепрочитанныеЭлектронныеПисьма/CRM_НепрочитанныеЭлектронныеПисьма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НепрочитанныеЭлектронныеПисьма</name>
  <dimensions>
    <name>УдалитьУчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПапка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/CRM_УчетныеЗаписиЭлектроннойПочты/CRM_УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_УчетныеЗаписиЭлектроннойПочты</name>
  <resources>
    <name>Администрирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Запись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/НастройкиУчетныхЗаписейЭлектроннойПочты/НастройкиУчетныхЗаписейЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетныхЗаписейЭлектроннойПочты</name>
  <resources>
    <name>ВключатьПодписьДляНовыхСообщений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФорматПодписиДляНовыхСообщений</name>
    <type>
      <types>EnumRef.СпособыРедактированияЭлектронныхПисем</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьДляНовыхСообщенийПростойТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьДляНовыхСообщенийФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьПодписьПриОтветеПересылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФорматПодписиПриОтветеПересылке</name>
    <type>
      <types>EnumRef.СпособыРедактированияЭлектронныхПисем</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьПриОтветеПересылкеПростойТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьПриОтветеПересылкеФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПерсональнаяУчетнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветственныйЗаОбработкуПисем</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ОтветственныйЗаВедениеПапок</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>УдалятьПисьмаПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПомещатьПисьмоВПапкуПисьмаОснования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВоВстроенномПочтовомКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВПредставлениеВключатьИмяПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбработкаПисемВыполняетсяВДругомПочтовомКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗаписьЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ДатыПоследнейЗагрузкиПочтовыхСообщений/ДатыПоследнейЗагрузкиПочтовыхСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыПоследнейЗагрузкиПочтовыхСообщений</name>
  <resources>
    <name>ДатаЗагрузкиПисем</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Documents/ЭлектронноеПисьмоВходящее/ЭлектронноеПисьмоВходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоВходящее</name>
  <posting>Deny</posting>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьИзСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаУведомленияОПрочтении</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НепринятыеВложения</name>
    <attributes>
      <name>ИмяВложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/DataProcessors/CRM_МенеджерПочты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьПапку(Параметры, АдресХранилища) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЭлектронноеПисьмоВходящее.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА CRM_НепрочитанныеЭлектронныеПисьма.Письмо ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК НеПрочитано
	               |ИЗ
	               |	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_НепрочитанныеЭлектронныеПисьма КАК CRM_НепрочитанныеЭлектронныеПисьма
	               |			ПО ЭлектронноеПисьмоВходящее.Ссылка = CRM_НепрочитанныеЭлектронныеПисьма.Письмо
	               |		ПО ПредметыПапкиВзаимодействий.Взаимодействие = ЭлектронноеПисьмоВходящее.Ссылка
	               |			И (ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма = &ПапкаЭлектронногоПисьма)
	               |ГДЕ
	               |	ЭлектронноеПисьмоВходящее.УчетнаяЗапись = &УчетнаяЗапись
	               |	И НЕ ЭлектронноеПисьмоВходящее.CRM_СкрытьИзСписка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЭлектронноеПисьмоИсходящее.Ссылка,
	               |	ЛОЖЬ
	               |ИЗ
	               |	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	               |		ПО ПредметыПапкиВзаимодействий.Взаимодействие = ЭлектронноеПисьмоИсходящее.Ссылка
	               |			И (ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма = &ПапкаЭлектронногоПисьма)
	               |ГДЕ
	               |	ЭлектронноеПисьмоИсходящее.УчетнаяЗапись = &УчетнаяЗапись
	               |	И НЕ ЭлектронноеПисьмоИсходящее.CRM_СкрытьИзСписка";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись",	Параметры.УчетнаяЗапись);
	Запрос.УстановитьПараметр("ПапкаЭлектронногоПисьма",		Параметры.Папка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПисьмоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ ПисьмоОбъект.ПометкаУдаления Тогда
			ПисьмоОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		
		ПисьмоОбъект.CRM_СкрытьИзСписка = Истина;
		
		Попытка
			ПисьмоОбъект.Записать();
		Исключение
		КонецПопытки;
		
		Если Выборка.НеПрочитано Тогда
			НаборНепрочитано = РегистрыСведений.CRM_НепрочитанныеЭлектронныеПисьма.СоздатьНаборЗаписей();
			НаборНепрочитано.Отбор.Письмо.Установить(Выборка.Ссылка);
			НаборНепрочитано.Записать(Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru='Очистка папки выполнена.';en='The folder is cleared.'");
	ПоместитьВоВременноеХранилище(ТекстСообщения, АдресХранилища);
	
КонецПроцедуры

Процедура ЗагрузитьПочтуПользователя(Параметры, АдресХранилища) Экспорт
	
	УчетнаяЗаписьОтбор = Параметры.УчетнаяЗаписьОтбор;
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДоступКУчетнымЗаписям.УчетнаяЗапись КАК УчетнаяЗапись
	|ПОМЕСТИТЬ ДоступныеУчетныеЗаписи
	|ИЗ
	|	РегистрСведений.CRM_УчетныеЗаписиЭлектроннойПочты КАК ДоступКУчетнымЗаписям
	|ГДЕ
	|	ДоступКУчетнымЗаписям.Пользователь В(&Пользователь)
	|	И ДоступКУчетнымЗаписям.Запись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеЗаписи.Ссылка КАК Ссылка,
	|	УчетныеЗаписи.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты,
	|	УчетныеЗаписи.Наименование КАК Наименование,
	|	ЕСТЬNULL(НастройкиУчетныхЗаписей.ПомещатьПисьмоВПапкуПисьмаОснования, ЛОЖЬ) КАК ПомещатьПисьмоВПапкуПисьмаОснования,
	|	ЕСТЬNULL(НастройкиУчетныхЗаписей.ОтветственныйЗаОбработкуПисем, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОтветственныйЗаОбработкуПисем,
	|	УчетныеЗаписи.ОставлятьКопииСообщенийНаСервере КАК ОставлятьКопии,
	|	УчетныеЗаписи.ПериодХраненияСообщенийНаСервере КАК ОставлятьДней,
	|	УчетныеЗаписи.ПротоколВходящейПочты КАК ПротоколВходящейПочты,
	|	УчетныеЗаписи.ИмяПользователя КАК ИмяПользователя,
	|	УчетныеЗаписи.Пользователь КАК Пользователь,
	|	УчетныеЗаписи.CRM_ИсточникЛидов КАК CRM_ИсточникЛидов,
	|	ЕСТЬNULL(ДатыПоследнейЗагрузки.ДатаЗагрузкиПисем, ДАТАВРЕМЯ(1, 1, 1, 1, 1, 1)) КАК ДатаЗагрузкиПисем,
	|	ВЫБОР
	|		КОГДА УчетныеЗаписи.ПротоколВходящейПочты = ""IMAP""
	|			ТОГДА ЕСТЬNULL(НастройкиУчетныхЗаписей.ОбработкаПисемВыполняетсяВДругомПочтовомКлиенте, ЛОЖЬ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбработкаПисемВедетсяВДругомПочтовомКлиенте
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты КАК НастройкиУчетныхЗаписей
	|		ПО (НастройкиУчетныхЗаписей.УчетнаяЗаписьЭлектроннойПочты = УчетныеЗаписи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений КАК ДатыПоследнейЗагрузки
	|		ПО (ДатыПоследнейЗагрузки.УчетнаяЗапись = УчетныеЗаписи.Ссылка)
	|ГДЕ
	|	УчетныеЗаписи.ИспользоватьДляПолучения
	|	И (УчетныеЗаписи.Ссылка В
	|				(ВЫБРАТЬ
	|					ДоступныеУчетныеЗаписи.УчетнаяЗапись
	|				ИЗ
	|					ДоступныеУчетныеЗаписи)
	|			ИЛИ УчетныеЗаписи.CRM_ЭтоОбщаяУчетнаяЗапись)
	|	И НЕ ЕСТЬNULL(НастройкиУчетныхЗаписей.НеИспользоватьВоВстроенномПочтовомКлиенте, ЛОЖЬ)
	|	И НЕ УчетныеЗаписи.ПометкаУдаления";
	// Если НЕ УчетнаяЗаписьОтбор = Неопределено Тогда
	//	ТекстЗапроса = ТекстЗапроса + "
	//	|	И CRM_УчетныеЗаписиЭлектроннойПочты.УчетнаяЗапись = &УчетнаяЗаписьОтбор";
	// КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("УчетнаяЗаписьОтбор", УчетнаяЗаписьОтбор);
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	РолиПользователя = CRM_БизнесПроцессыСервер.ПолучитьРолиПоПользователю(ТекущийПользователь);
	РолиПользователя.Добавить(ТекущийПользователь);
	Запрос.УстановитьПараметр("Пользователь", РолиПользователя);
	
	УстановитьПривилегированныйРежим(Истина);
	// -CRM
	
	Выборка = Запрос.Выполнить().Выбрать();

	ПолученоПисем = 0;
	ДоступноУчетныхЗаписей = Выборка.Количество();
	Если ДоступноУчетныхЗаписей = 0 Тогда
		// +CRM
		// ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нет доступных для получения почты учетных записей';en='Is not present mails of login accounts accessible to obtaining'"));
		Если УчетнаяЗаписьОтбор = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нет доступных для получения почты учетных записей';en='Is not present mails of login accounts accessible to obtaining'"));
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Учетная запись почты: "+ УчетнаяЗаписьОтбор +" не используется для получения.'"));
		КонецЕСли;
		// -CRM
		Возврат;
	КонецЕсли;
	
	// +CRM
	// УстановитьПривилегированныйРежим(Истина); // перенесено выше!
	СписокПолученныхПисем = Новый СписокЗначений;
	// -CRM
	ТекстыОшибок = "";
	Получено = 0;

	Пока Выборка.Следующий() Цикл
		ЕстьОшибки = Ложь;

		
		СтруктураМассивовПисем = CRM_УправлениеЭлектроннойПочтой.СтруктураМассиваПисем();
		ТекстСообщенияОбОшибке = "";
		CRM_УправлениеЭлектроннойПочтой.ПолучитьПисьма(Выборка, ЕстьОшибки, Получено, СтруктураМассивовПисем, ТекстСообщенияОбОшибке);
		Если ЕстьОшибки Тогда
			ТекстыОшибок = ТекстыОшибок + ТекстСообщенияОбОшибке+"
			|";
			Продолжить;
		КонецЕсли;	
		ПолученоПисем = ПолученоПисем + Получено;
		CRM_УправлениеЭлектроннойПочтой.ОпределитьЗагруженныеРанееПодчиненныеПисьма(Выборка.Ссылка, СтруктураМассивовПисем.ВсеПолученныеПисьма);
		Взаимодействия.ЗаполнитьКонтактыМассиваВзаимодействий(СтруктураМассивовПисем.ВсеПолученныеПисьма);
		Взаимодействия.УстановитьПапкиДляМассиваПисем(СтруктураМассивовПисем.ПисьмаДляОпределенияПапок);
		Взаимодействия.РассчитатьРассмотреноПоПредметам(СтруктураМассивовПисем.ВсеПолученныеПисьма);
		Взаимодействия.РассчитатьРассмотреноПоКонтактам(СтруктураМассивовПисем.ВсеПолученныеПисьма);
		
		// +CRM
		
		МассивПисем = СтруктураМассивовПисем.ВсеПолученныеПисьма;
		
		Для Каждого СтрокаМассива ИЗ МассивПисем Цикл
			СписокПолученныхПисем.Добавить(СтрокаМассива);
		КонецЦикла;
		// -CRM
		
	КонецЦикла;
	Если ТекстыОшибок = "" Тогда
		ТекстыОшибок = "Получено писем: "+Получено;
	КонецЕсли;	
	ПоместитьВоВременноеХранилище(ТекстыОшибок, АдресХранилища);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
